Jualin/app/Controllers/User/Produk.php

SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `AccountId` = 'fb6c5b17-ca63-4c60-8780-a559a92a9569'
---
    public function index()
    {
        $AccountId = session()->get('AccountId');

        $data = [
            'title' => 'Produk',
            'Account' => $this->accountModel->getAccountById($AccountId),
            'total_products' => $this->productsModel->where('AccountId', $AccountId)->countAllResults(),

INSERT INTO `products` (`AccountId`, `name`, `description`, `price`, `stock`, `image`, `created_at`, `updated_at`) VALUES ('fb6c5b17-ca63-4c60-8780-a559a92a9569', 'Hyjr', 'Bu jicpi gah mismen potvocip cudzub vezhutnun pacus hivvokdub wuvuzo hu wifi hodepki jomfibne. Cimuzza jodinpi lip sojseep wus mitok muebfef hab coczunuw uzfifwu volavjes hu. ', '123', '402', '1750527466_7c59727c61dc410fef5f.jpg', '2025-06-21 17:37:46', '2025-06-21 17:37:46')
---
    public function Add()
    {
        $AccountId = session()->get('AccountId');

        $data = [
            'AccountId'   => $AccountId,
            'name'        => $this->request->getPost('name'),
            'description' => $this->request->getPost('description'),
            'price'       => $this->request->getPost('price'),
            'stock'       => $this->request->getPost('stock'),
        ];

        $image = $this->request->getFile('image');

        if ($image && $image->isValid() && !$image->hasMoved()) {
            $newName = $image->getRandomName();
            $image->move(ROOTPATH . 'public/uploads/product', $newName);
            $data['image'] = $newName;
        } else {
            $data['image'] = null;
        }

        if (!$this->productsModel->insert($data)) {

DELETE FROM `products`
WHERE `id` IN ('9')
---
    public function Delete($id)
    {
        if (!$this->productsModel->delete($id)) {