Jualin/app/Controllers/Home.php

SELECT *
FROM `accounts`
WHERE `Email` = 'esi.mikisia567@gmail.com'
AND `accounts`.`deleted_at` IS NULL
 LIMIT 1
---
    public function prosesLogin(): \CodeIgniter\HTTP\ResponseInterface
    {


        // Ambil data dari FormData (POST biasa, bukan JSON)
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Validasi input dasar
        if (empty($email) || empty($password)) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Email dan password wajib diisi'
            ]);
        }

        // Cari user
        $akun = $this->accountModel->where('Email', $email)->first();