Jualin/app/Models/AccountModel.php

    public function getAccountById(string $AccountId): ?array
    {

        return $this->select('AccountId, Email, FullName, PhoneNumber, BirthDate')
            ->where('AccountId', $AccountId)
            ->first();
---
SELECT `AccountId`, `Email`, `FullName`, `PhoneNumber`, `BirthDate`
FROM `accounts`
WHERE `AccountId` = 'fb6c5b17-ca63-4c60-8780-a559a92a9569'
AND `accounts`.`deleted_at` IS NULL
 LIMIT 1